<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"1bc989d35bf25ec277f422ed20d383f85c57d269eebf0740d90d52f387835686","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1155 at https://github.com/cal-itp/data-infra/actions/runs/20049009477","plan_out_hash":"19b69f87053ad563e7f7a43a92ee30da6afded5d0d1521c49eac75dccf94cf9f","plan_hash":"08a8df0c3e8b30a249b77636f712eb3f19c30588a498e6891149b45006f6f5d2","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 5 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "UxnpEg==" -> (known after apply)
!~      detect_md5hash      = "nNS2NQxEv9QuNz1Evihv4Q==" -> "different hash"
!~      generation          = 1765231988264679 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "nNS2NQxEv9QuNz1Evihv4Q==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/payments/_int_payments.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "wODMcA==" -> (known after apply)
!~      detect_md5hash      = "tuYyCRja13CEhEblQn7u/A==" -> "different hash"
!~      generation          = 1751416667352298 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/intermediate/payments/_int_payments.yml"
!~      md5hash             = "tuYyCRja13CEhEblQn7u/A==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/payments/_int_payments.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/payments/int_payments__refunds_to_aggregations.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "HxjT6g==" -> (known after apply)
!~      detect_md5hash      = "zZIja39dr1TtsxxCA/4kIg==" -> "different hash"
!~      generation          = 1751416670127544 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/intermediate/payments/int_payments__refunds_to_aggregations.sql"
!~      md5hash             = "zZIja39dr1TtsxxCA/4kIg==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/payments/int_payments__refunds_to_aggregations.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/payments/littlepay_feed_unions/int_littlepay__unioned_refunds.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "L8ggEw==" -> (known after apply)
!~      detect_md5hash      = "glUiaPQIv7b7qMen0eNG5w==" -> "different hash"
!~      generation          = 1760473616986578 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/intermediate/payments/littlepay_feed_unions/int_littlepay__unioned_refunds.sql"
!~      md5hash             = "glUiaPQIv7b7qMen0eNG5w==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/payments/littlepay_feed_unions/int_littlepay__unioned_refunds.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "b6cARg==" -> (known after apply)
!~      detect_md5hash      = "RsVFtCRmW9aQ986K+1DUNg==" -> "different hash"
!~      generation          = 1765231989850957 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "RsVFtCRmW9aQ986K+1DUNg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1155](https://github.com/cal-itp/data-infra/actions/runs/20049009477)